Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/CA90-S1/edc/PIC32CZ2051CA90176S1.PIC
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x52000444"/>
      <edc:SFRDef ltx:memberofperipheral="INTCTRL" edc:cname="PIN" edc:nzwidth="0x20" edc:access="--------------------------rrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F" edc:_addr="0x52000448">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="INTCTRL">
            <edc:SFRFieldDef edc:cname="PIN" edc:nzwidth="0x6" edc:desc="Pending IRQ Num"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3B4" edc:_addr="0x5200044C"/>
      <edc:SFRDef ltx:memberofperipheral="EXTDMA" edc:cname="FETCH_ADDR_LSB" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x52000800">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EXTDMA">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x20" edc:desc="Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EXTDMA" edc:cname="FETCH_ADDR_MSB" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x52000804"/>
      <edc:SFRDef ltx:memberofperipheral="EXTDMA" edc:cname="FETCH_LEN" edc:nzwidth="0x20" edc:access="--nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FFFFFFF" edc:_addr="0x52000808">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EXTDMA">
            <edc:SFRFieldDef edc:cname="LEN" edc:nzwidth="0x1C" edc:desc="Length of data block"/>
            <edc:SFRFieldDef edc:cname="CST_ADDR" edc:nzwidth="0x1" edc:desc="CST Address"/>
            <edc:SFRFieldDef edc:cname="REALIGN" edc:nzwidth="0x1" edc:desc="Realign"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EXTDMA" edc:cname="FETCH_TAG" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x5200080C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EXTDMA">
            <edc:SFRFieldDef edc:cname="TAG" edc:nzwidth="0x20" edc:desc="User TAG"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EXTDMA" edc:cname="PUSH_ADDR_LSB" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x52000810">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EXTDMA">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x20" edc:desc="Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EXTDMA" edc:cname="PUSH_ADDR_MSB" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x52000814"/>
      <edc:SFRDef ltx:memberofperipheral="EXTDMA" edc:cname="PUSH_LEN" edc:nzwidth="0x20" edc:access="--nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FFFFFFF" edc:_addr="0x52000818">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EXTDMA">
            <edc:SFRFieldDef edc:cname="LEN" edc:nzwidth="0x1C" edc:desc="Length of data block"/>
            <edc:SFRFieldDef edc:cname="CST_ADDR" edc:nzwidth="0x1" edc:desc="CST Address"/>
            <edc:SFRFieldDef edc:cname="REALIGN" edc:nzwidth="0x1" edc:desc="Realign"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EXTDMA" edc:cname="INT_EN" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x5200081C"/>
      <edc:SFRDef ltx:memberofperipheral="EXTDMA" edc:cname="INT_ENSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x52000820"/>
      <edc:SFRDef ltx:memberofperipheral="EXTDMA" edc:cname="INT_ENCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x52000824"/>
      <edc:SFRDef ltx:memberofperipheral="EXTDMA" edc:cname="INT_STATRAW" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x52000828"/>
      <edc:SFRDef ltx:memberofperipheral="EXTDMA" edc:cname="INT_STAT" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x5200082C"/>
      <edc:SFRDef ltx:memberofperipheral="EXTDMA" edc:cname="INT_STAT_CLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x52000830"/>
      <edc:SFRDef ltx:memberofperipheral="EXTDMA" edc:cname="CONFIG" edc:nzwidth="0x20" edc:access="---------------------------nnnnn" edc:impl="0x1F" edc:_addr="0x52000834">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EXTDMA">
            <edc:SFRFieldDef edc:cname="FETCHER_SCATTER_GATHER" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PUSHER_SCATTER_GATHER" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STOP_PUSHER" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STOP_FETCHER" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SOFTWARE_RESET" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EXTDMA" edc:cname="START" edc:nzwidth="0x20" edc:access="------------------------------nn" edc:impl="0x3" edc:_addr="0x52000838">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EXTDMA">
            <edc:SFRFieldDef edc:cname="START_FETCH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="START_PUSH" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
